{
  "cmd": "python3 sample-correct-incorrect.py dev-v1.1.json albert-results/new-dev-5.json albert-results/predictions-original.json albert-results/predictions-5.json 10 interesting_data/albert-5-word-sample-10.json",
  "original_exact_match": 83.53831598864711,
  "original_f1": 90.6009470053024,
  "new_exact_match": 37.51182592242195,
  "new_f1": 54.38547045591816,
  "new_incorrect_contexts": {
    "56d729180d65d21400198428": {
      "context": "After a punt from both teams, Carolina got on track with a 9-play, 73-yard scoring drive. Newton completed 4 of 4 passes for 51 yards and rushed twice for 25 yards, while Jonathan Stewart finished the drive with a 1-yard touchdown run, cutting the score to 10–7 with 11:28 left in the second quarter. Later on, Broncos receiver Jordan Norwood received Brad Nortman's short 28-yard punt surrounded by Panthers players, but none of them attempted to make a tackle, apparently thinking Norwood had called a fair catch. Norwood had not done so, and with no resistance around him, he took off for a Super Bowl record 61-yard return before Mario Addison dragged him down on the Panthers 14-yard line. Despite Denver's excellent field position, they could not get the ball into the end zone, so McManus kicked a 33-yard field goal that increased their lead to 13–7.",
      "answers": [
        {
          "answer_start": 267,
          "text": "11:28"
        },
        {
          "answer_start": 267,
          "text": "11:28"
        },
        {
          "answer_start": 267,
          "text": "11:28"
        }
      ],
      "original_question": "How much time was left in the quarter when Stewart got the touchdown?",
      "new_question": "How quarter Stewart got touchdown",
      "original_prediction": "11:28",
      "new_prediction": "second quarter"
    },
    "56e0d402231d4119001ac3ff": {
      "context": "In 1881, Tesla moved to Budapest to work under Ferenc Puskás at a telegraph company, the Budapest Telephone Exchange. Upon arrival, Tesla realized that the company, then under construction, was not functional, so he worked as a draftsman in the Central Telegraph Office instead. Within a few months, the Budapest Telephone Exchange became functional and Tesla was allocated the chief electrician position. During his employment, Tesla made many improvements to the Central Station equipment and claimed to have perfected a telephone repeater or amplifier, which was never patented nor publicly described.",
      "answers": [
        {
          "answer_start": 378,
          "text": "chief electrician"
        },
        {
          "answer_start": 378,
          "text": "chief electrician"
        },
        {
          "answer_start": 378,
          "text": "chief electrician"
        }
      ],
      "original_question": "What was Tesla's position at the Budapest Telephone Exchange?",
      "new_question": "What Tesla's Budapest Telephone Exchange",
      "original_prediction": "chief electrician",
      "new_prediction": "Tesla moved to Budapest to work under Ferenc Puskás at a telegraph company, the Budapest Telephone Exchange"
    },
    "56f7cb10a6d7ea1400e17286": {
      "context": "His translation of the Bible into the vernacular (instead of Latin) made it more accessible, which had a tremendous impact on the church and German culture. It fostered the development of a standard version of the German language, added several principles to the art of translation, and influenced the writing of an English translation, the Tyndale Bible. His hymns influenced the development of singing in churches. His marriage to Katharina von Bora set a model for the practice of clerical marriage, allowing Protestant clergy to marry.",
      "answers": [
        {
          "answer_start": 341,
          "text": "Tyndale Bible"
        },
        {
          "answer_start": 341,
          "text": "Tyndale Bible."
        },
        {
          "answer_start": 341,
          "text": "Tyndale"
        }
      ],
      "original_question": "What version of the English translation of the Bible did Luther's translation affect?",
      "new_question": "What translation Bible translation affect",
      "original_prediction": "Tyndale Bible",
      "new_prediction": "His translation of the Bible into the vernacular"
    },
    "5725ff8238643c19005acf4d": {
      "context": "Passenger rail service is provided by Amtrak San Joaquins. The main passenger rail station is the recently renovated historic Santa Fe Railroad Depot in Downtown Fresno. The Bakersfield-Stockton mainlines of the Burlington Northern Santa Fe Railway and Union Pacific Railroad railroads cross in Fresno, and both railroads maintain railyards within the city; the San Joaquin Valley Railroad also operates former Southern Pacific branchlines heading west and south out of the city. The city of Fresno is planned to serve the future California High Speed Rail.",
      "answers": [
        {
          "answer_start": 492,
          "text": "Fresno"
        },
        {
          "answer_start": 492,
          "text": "Fresno"
        },
        {
          "answer_start": 492,
          "text": "Fresno"
        }
      ],
      "original_question": "Which city is planned to be a part of the California High Speed Rail?",
      "new_question": "Which planned High Speed Rail",
      "original_prediction": "Fresno",
      "new_prediction": "California High Speed Rail"
    },
    "57264c42dd62a815002e80c9": {
      "context": "The dominant explanation for the Black Death is the plague theory, which attributes the outbreak to Yersinia pestis, also responsible for an epidemic that began in southern China in 1865, eventually spreading to India. The investigation of the pathogen that caused the 19th-century plague was begun by teams of scientists who visited Hong Kong in 1894, among whom was the French-Swiss bacteriologist Alexandre Yersin, after whom the pathogen was named Yersinia pestis. The mechanism by which Y. pestis was usually transmitted was established in 1898 by Paul-Louis Simond and was found to involve the bites of fleas whose midguts had become obstructed by replicating Y. pestis several days after feeding on an infected host. This blockage results in starvation and aggressive feeding behaviour by the fleas, which repeatedly attempt to clear their blockage by regurgitation, resulting in thousands of plague bacteria being flushed into the feeding site, infecting the host. The bubonic plague mechanism was also dependent on two populations of rodents: one resistant to the disease, which act as hosts, keeping the disease endemic, and a second that lack resistance. When the second population dies, the fleas move on to other hosts, including people, thus creating a human epidemic.",
      "answers": [
        {
          "answer_start": 469,
          "text": "The mechanism by which Y. pestis was usually transmitted"
        },
        {
          "answer_start": 473,
          "text": "mechanism by which Y. pestis was usually transmitted"
        },
        {
          "answer_start": 469,
          "text": "The mechanism by which Y. pestis was usually transmitted"
        }
      ],
      "original_question": "What did Paul-Louis Simond establish in 1898?",
      "new_question": "What Paul-Louis Simond establish 1898",
      "original_prediction": "The mechanism by which Y. pestis was usually transmitted",
      "new_prediction": "The mechanism by which Y. pestis was usually transmitted was established in 1898"
    },
    "572758e0f1498d1400e8f6b1": {
      "context": "Funding for private schools is generally provided through student tuition, endowments, scholarship/voucher funds, and donations and grants from religious organizations or private individuals. Government funding for religious schools is either subject to restrictions or possibly forbidden, according to the courts' interpretation of the Establishment Clause of the First Amendment or individual state Blaine Amendments. Non-religious private schools theoretically could qualify for such funding without hassle, preferring the advantages of independent control of their student admissions and course content instead of the public funding they could get with charter status.",
      "answers": [
        {
          "answer_start": 657,
          "text": "charter"
        },
        {
          "answer_start": 657,
          "text": "charter"
        },
        {
          "answer_start": 657,
          "text": "charter"
        }
      ],
      "original_question": "Granting what status would allow private non-religious schools in the US to receive public funds?",
      "new_question": "Granting status allow non-religious funds",
      "original_prediction": "charter",
      "new_prediction": "Non-religious private schools theoretically could qualify for such funding without hassle"
    },
    "5727cebc2ca10214002d96f2": {
      "context": "Harvard's 2,400 professors, lecturers, and instructors instruct 7,200 undergraduates and 14,000 graduate students. The school color is crimson, which is also the name of the Harvard sports teams and the daily newspaper, The Harvard Crimson. The color was unofficially adopted (in preference to magenta) by an 1875 vote of the student body, although the association with some form of red can be traced back to 1858, when Charles William Eliot, a young graduate student who would later become Harvard's 21st and longest-serving president (1869–1909), bought red bandanas for his crew so they could more easily be distinguished by spectators at a regatta.",
      "answers": [
        {
          "answer_start": 89,
          "text": "14,000"
        },
        {
          "answer_start": 89,
          "text": "14,000"
        },
        {
          "answer_start": 89,
          "text": "14,000"
        }
      ],
      "original_question": "How many graduate students does Harvard have?",
      "new_question": "How graduate students does Harvard",
      "original_prediction": "14,000",
      "new_prediction": "Harvard's 2,400 professors, lecturers, and instructors instruct 7,200 undergraduates and 14,000 graduate students"
    },
    "57281cb22ca10214002d9e1e": {
      "context": "Six soundtrack releases have been released since 2005. The first featured tracks from the first two series, the second and third featured music from the third and fourth series respectively. The fourth was released on 4 October 2010 as a two disc special edition and contained music from the 2008–2010 specials (The Next Doctor to End of Time Part 2). The soundtrack for Series 5 was released on 8 November 2010. In February 2011, a soundtrack was released for the 2010 Christmas special: \"A Christmas Carol\", and in December 2011 the soundtrack for Series 6 was released, both by Silva Screen Records.",
      "answers": [
        {
          "answer_start": 0,
          "text": "Six"
        },
        {
          "answer_start": 0,
          "text": "Six"
        },
        {
          "answer_start": 0,
          "text": "Six"
        }
      ],
      "original_question": "How many Doctor Who soundtracks have been released since 2005?",
      "new_question": "How Who soundtracks released 2005",
      "original_prediction": "Six",
      "new_prediction": "2005"
    },
    "5730b5cc396df919000962d3": {
      "context": "In addition, the United Methodist Church prohibits the celebration of same-sex unions. Rev. Jimmy Creech was defrocked after a highly publicized church trial in 1999 on account of his participation in same-sex union ceremonies. It forbids any United Methodist board, agency, committee, commission, or council to give United Methodist funds to any gay organization or group, or otherwise use such funds to promote the acceptance of homosexuality. Other ministers have been defrocked for officiating at same-sex weddings and several trials of others are scheduled. Still, some congregations have sought other ways to recognize same-sex couples. For example, one congregation hosted a proposal for a same-sex couple announcing their engagement. Moreover, some churches, especially in 2016 after same-sex marriage was legalized nationwide, have provided blessings for same-sex marriages. In April of 2016, a United Methodist bishop made a bold statement by performing a same-sex marriage in church as a clear sign of his advocacy for change.",
      "answers": [
        {
          "answer_start": 161,
          "text": "1999"
        },
        {
          "answer_start": 161,
          "text": "1999"
        },
        {
          "answer_start": 161,
          "text": "1999"
        }
      ],
      "original_question": "In what year was the trial of Rev. Jimmy Creech?",
      "new_question": "what trial Rev Jimmy Creech",
      "original_prediction": "1999",
      "new_prediction": "Jimmy Creech was defrocked after a highly publicized church trial in 1999 on account of his participation in same-sex union ceremonies"
    },
    "5737a84dc3c5551400e51f5b": {
      "context": "For certain physical scenarios, it is impossible to model forces as being due to gradient of potentials. This is often due to macrophysical considerations that yield forces as arising from a macroscopic statistical average of microstates. For example, friction is caused by the gradients of numerous electrostatic potentials between the atoms, but manifests as a force model that is independent of any macroscale position vector. Nonconservative forces other than friction include other contact forces, tension, compression, and drag. However, for any sufficiently detailed description, all these forces are the results of conservative ones since each of these macroscopic forces are the net results of the gradients of microscopic potentials.",
      "answers": [
        {
          "answer_start": 252,
          "text": "friction"
        },
        {
          "answer_start": 252,
          "text": "friction"
        },
        {
          "answer_start": 252,
          "text": "friction"
        },
        {
          "answer_start": 252,
          "text": "friction"
        }
      ],
      "original_question": "What do electrostatic gradiient potentials create?",
      "new_question": "What electrostatic gradiient potentials create",
      "original_prediction": "friction",
      "new_prediction": "friction is caused by the gradients of numerous electrostatic potentials between the atoms"
    }
  },
  "both_correct_contexts": {
    "56d99c44dc89441400fdb5d7": {
      "context": "Manning finished the year with a career-low 67.9 passer rating, throwing for 2,249 yards and nine touchdowns, with 17 interceptions. In contrast, Osweiler threw for 1,967 yards, 10 touchdowns and six interceptions for a rating of 86.4. Veteran receiver Demaryius Thomas led the team with 105 receptions for 1,304 yards and six touchdowns, while Emmanuel Sanders caught 76 passes for 1,135 yards and six scores, while adding another 106 yards returning punts. Tight end Owen Daniels was also a big element of the passing game with 46 receptions for 517 yards. Running back C. J. Anderson was the team's leading rusher 863 yards and seven touchdowns, while also catching 25 passes for 183 yards. Running back Ronnie Hillman also made a big impact with 720 yards, five touchdowns, 24 receptions, and a 4.7 yards per carry average. Overall, the offense ranked 19th in scoring with 355 points and did not have any Pro Bowl selections.",
      "answers": [
        {
          "answer_start": 115,
          "text": "17"
        },
        {
          "answer_start": 115,
          "text": "17"
        },
        {
          "answer_start": 115,
          "text": "17"
        }
      ],
      "original_question": "How many interceptions did manning have in 2015?",
      "new_question": "How interceptions did manning 2015",
      "original_prediction": "17",
      "new_prediction": "17"
    },
    "56bf5b933aeaaa14008c95ed": {
      "context": "In addition to the Vince Lombardi Trophy that all Super Bowl champions receive, the winner of Super Bowl 50 will also receive a large, 18-karat gold-plated \"50\". Each digit will weigh 33 lb (15 kg) for a total of 66 lb (30 kg). Like the Lombardi Trophy, the \"50\" will be designed by Tiffany & Co.",
      "answers": [
        {
          "answer_start": 19,
          "text": "Vince Lombardi Trophy"
        },
        {
          "answer_start": 15,
          "text": "the Vince Lombardi Trophy"
        },
        {
          "answer_start": 19,
          "text": "Vince Lombardi Trophy"
        }
      ],
      "original_question": "What is the name of the trophy given to anyone who plays on the winning team in a Super Bowl?",
      "new_question": "What trophy anyone plays winning",
      "original_prediction": "Vince Lombardi Trophy",
      "new_prediction": "Vince Lombardi Trophy"
    },
    "56e1075ae3433e1400422afe": {
      "context": "Before World War I, Tesla sought overseas investors. After the war started, Tesla lost the funding he was receiving from his patents in European countries. Eventually, he sold Wardenclyffe for $20,000 ($472,500 in today's dollars). In 1917, around the time that the Wardenclyffe Tower was demolished by Boldt to make the land a more viable real estate asset, Tesla received AIEE's highest honor, the Edison Medal.",
      "answers": [
        {
          "answer_start": 396,
          "text": "the Edison Medal."
        },
        {
          "answer_start": 396,
          "text": "the Edison Medal"
        },
        {
          "answer_start": 396,
          "text": "the Edison Medal."
        }
      ],
      "original_question": "What award was given to Tesla?",
      "new_question": "What award was given Tesla",
      "original_prediction": "Edison Medal",
      "new_prediction": "Edison Medal"
    },
    "56f8907faef23719006261b2": {
      "context": "Despite the disagreements on the Eucharist, the Marburg Colloquy paved the way for the signing in 1530 of the Augsburg Confession, and for the formation of the Schmalkaldic League the following year by leading Protestant nobles such as John of Saxony, Philip of Hesse, and George, Margrave of Brandenburg-Ansbach. The Swiss cities, however, did not sign these agreements.",
      "answers": [
        {
          "answer_start": 98,
          "text": "1530"
        },
        {
          "answer_start": 98,
          "text": "1530"
        },
        {
          "answer_start": 98,
          "text": "1530"
        }
      ],
      "original_question": "When was the Augsburg Confession signed?",
      "new_question": "When was Augsburg Confession signed",
      "original_prediction": "1530",
      "new_prediction": "1530"
    },
    "57108198b654c5140001f93a": {
      "context": "Approximately one million Protestants in modern France represent some 2% of its population. Most are concentrated in Alsace in northeast France and the Cévennes mountain region in the south, who still regard themselves as Huguenots to this day.[citation needed] A diaspora of French Australians still considers itself Huguenot, even after centuries of exile. Long integrated into Australian society, it is encouraged by the Huguenot Society of Australia to embrace and conserve its cultural heritage, aided by the Society's genealogical research services.",
      "answers": [
        {
          "answer_start": 152,
          "text": "Cévennes"
        },
        {
          "answer_start": 152,
          "text": "Cévennes"
        },
        {
          "answer_start": 152,
          "text": "Cévennes mountain region"
        }
      ],
      "original_question": "What is the southern region where protestants are concentrated?",
      "new_question": "What southern region protestants concentrated",
      "original_prediction": "Cévennes mountain region",
      "new_prediction": "Cévennes mountain region"
    },
    "572a14af3f37b319004786c4": {
      "context": "The immune system is a system of many biological structures and processes within an organism that protects against disease. To function properly, an immune system must detect a wide variety of agents, known as pathogens, from viruses to parasitic worms, and distinguish them from the organism's own healthy tissue. In many species, the immune system can be classified into subsystems, such as the innate immune system versus the adaptive immune system, or humoral immunity versus cell-mediated immunity. In humans, the blood–brain barrier, blood–cerebrospinal fluid barrier, and similar fluid–brain barriers separate the peripheral immune system from the neuroimmune system which protects the brain.",
      "answers": [
        {
          "answer_start": 655,
          "text": "neuroimmune system"
        },
        {
          "answer_start": 655,
          "text": "neuroimmune"
        },
        {
          "answer_start": 655,
          "text": "neuroimmune system"
        },
        {
          "answer_start": 655,
          "text": "neuroimmune system"
        }
      ],
      "original_question": "What is the immune system of the brained known as?",
      "new_question": "What immune system brained known",
      "original_prediction": "neuroimmune system",
      "new_prediction": "neuroimmune system"
    },
    "572a0a686aef0514001551ed": {
      "context": "Immunology is strongly experimental in everyday practice but is also characterized by an ongoing theoretical attitude. Many theories have been suggested in immunology from the end of the nineteenth century up to the present time. The end of the 19th century and the beginning of the 20th century saw a battle between \"cellular\" and \"humoral\" theories of immunity. According to the cellular theory of immunity, represented in particular by Elie Metchnikoff, it was cells – more precisely, phagocytes – that were responsible for immune responses. In contrast, the humoral theory of immunity, held, among others, by Robert Koch and Emil von Behring, stated that the active immune agents were soluble components (molecules) found in the organism’s “humors” rather than its cells.",
      "answers": [
        {
          "answer_start": 439,
          "text": "Elie Metchnikoff"
        },
        {
          "answer_start": 439,
          "text": "Elie Metchnikoff"
        },
        {
          "answer_start": 439,
          "text": "Elie Metchnikoff"
        }
      ],
      "original_question": "Who was the main proponent of the cellular theory of immunity?",
      "new_question": "Who proponent cellular theory immunity",
      "original_prediction": "Elie Metchnikoff",
      "new_prediction": "Elie Metchnikoff"
    },
    "57295b5b1d04691400779319": {
      "context": "The chloroplastidan chloroplasts, or green chloroplasts, are another large, highly diverse primary chloroplast lineage. Their host organisms are commonly known as the green algae and land plants. They differ from glaucophyte and red algal chloroplasts in that they have lost their phycobilisomes, and contain chlorophyll b instead. Most green chloroplasts are (obviously) green, though some aren't, like some forms of Hæmatococcus pluvialis, due to accessory pigments that override the chlorophylls' green colors. Chloroplastidan chloroplasts have lost the peptidoglycan wall between their double membrane, and have replaced it with an intermembrane space. Some plants seem to have kept the genes for the synthesis of the peptidoglycan layer, though they've been repurposed for use in chloroplast division instead.",
      "answers": [
        {
          "answer_start": 309,
          "text": "chlorophyll b"
        },
        {
          "answer_start": 309,
          "text": "chlorophyll b"
        },
        {
          "answer_start": 309,
          "text": "chlorophyll b"
        }
      ],
      "original_question": "What do green chloroplasts have instead of phycobilisomes?",
      "new_question": "What green chloroplasts instead phycobilisomes",
      "original_prediction": "chlorophyll b",
      "new_prediction": "chlorophyll b"
    },
    "572975073f37b31900478416": {
      "context": "Like mitochondria, chloroplasts use the potential energy stored in an H+, or hydrogen ion gradient to generate ATP energy. The two photosystems capture light energy to energize electrons taken from water, and release them down an electron transport chain. The molecules between the photosystems harness the electrons' energy to pump hydrogen ions into the thylakoid space, creating a concentration gradient, with more hydrogen ions (up to a thousand times as many) inside the thylakoid system than in the stroma. The hydrogen ions in the thylakoid space then diffuse back down their concentration gradient, flowing back out into the stroma through ATP synthase. ATP synthase uses the energy from the flowing hydrogen ions to phosphorylate adenosine diphosphate into adenosine triphosphate, or ATP. Because chloroplast ATP synthase projects out into the stroma, the ATP is synthesized there, in position to be used in the dark reactions.",
      "answers": [
        {
          "answer_start": 347,
          "text": "into the thylakoid space"
        },
        {
          "answer_start": 356,
          "text": "thylakoid space"
        },
        {
          "answer_start": 347,
          "text": "into the thylakoid space"
        }
      ],
      "original_question": "Where do chloroplasts pump hydrogen?",
      "new_question": "Where do chloroplasts pump hydrogen",
      "original_prediction": "thylakoid space",
      "new_prediction": "into the thylakoid space"
    },
    "57299d1c1d04691400779584": {
      "context": "The fundamental theorem of arithmetic continues to hold in unique factorization domains. An example of such a domain is the Gaussian integers Z[i], that is, the set of complex numbers of the form a + bi where i denotes the imaginary unit and a and b are arbitrary integers. Its prime elements are known as Gaussian primes. Not every prime (in Z) is a Gaussian prime: in the bigger ring Z[i], 2 factors into the product of the two Gaussian primes (1 + i) and (1 − i). Rational primes (i.e. prime elements in Z) of the form 4k + 3 are Gaussian primes, whereas rational primes of the form 4k + 1 are not.",
      "answers": [
        {
          "answer_start": 254,
          "text": "arbitrary integers"
        },
        {
          "answer_start": 254,
          "text": "arbitrary integers"
        },
        {
          "answer_start": 254,
          "text": "arbitrary integers"
        },
        {
          "answer_start": 254,
          "text": "arbitrary integers"
        }
      ],
      "original_question": "What do a and b represent in a Gaussian integer expression? ",
      "new_question": "What b represent Gaussian expression",
      "original_prediction": "arbitrary integers",
      "new_prediction": "arbitrary integers"
    }
  }
}